; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_1 ?v5 - type_3 ?v4 - type_1)
 	      (pred_3 ?v6 - object ?v4 - type_1)
	      (pred_2 ?v5 - type_3 ?v8 - type_2)
	      (pred_4 ?v5 - type_3 ?v6 - object ?v8 - type_2))

   (:action op_1
       :parameters  (?v5 - type_3 ?v2 ?v3 - type_1)
       :precondition (and  (pred_1 ?v5 ?v2))
       :effect (and  (pred_1 ?v5 ?v3)
		     (not (pred_1 ?v5 ?v2))))

   (:action op_2
       :parameters (?v5 - type_3 ?v1 - object ?v7 - type_1 ?v8 - type_2)
       :precondition  (and  (pred_3 ?v1 ?v7) (pred_1 ?v5 ?v7) (pred_2 ?v5 ?v8))
       :effect (and (pred_4 ?v5 ?v1 ?v8)
		    (not (pred_3 ?v1 ?v7)) 
		    (not (pred_2 ?v5 ?v8))))

   (:action op_3
       :parameters (?v5 - type_3 ?v1 - object ?v7 - type_1 ?v8 - type_2)
       :precondition  (and  (pred_4 ?v5 ?v1 ?v8) (pred_1 ?v5 ?v7))
       :effect (and (pred_3 ?v1 ?v7)
		    (pred_2 ?v5 ?v8)
		    (not (pred_4 ?v5 ?v1 ?v8)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_01 - type_3
obj_03 obj_08 - type_2
obj_10 obj_04 obj_02 obj_07 - type_1
obj_06 obj_05 obj_09 - object)
(:init
(pred_1 obj_01 obj_07)
(pred_2 obj_01 obj_03)
(pred_2 obj_01 obj_08)
(pred_3 obj_06 obj_02)
(pred_3 obj_05 obj_10)
(pred_3 obj_09 obj_04)
)
(:goal
(and
(pred_3 obj_06 obj_04)
(pred_3 obj_05 obj_02)
(pred_3 obj_09 obj_02)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_4 obj_01 ?b obj_08))))
)
)

; plan
1. (op_1 obj_01 obj_07 obj_10)
   deleted: (pred_1 obj_01 obj_07)
   added: (pred_1 obj_01 obj_10)
   goals met: 0 of 3
2. (op_2 obj_01 obj_05 obj_10 obj_03)
   deleted: (pred_3 obj_05 obj_10) (pred_2 obj_01 obj_03)
   added: (pred_4 obj_01 obj_05 obj_03)
   goals met: 0 of 3
3. (op_1 obj_01 obj_10 obj_02)
   deleted: (pred_1 obj_01 obj_10)
   added: (pred_1 obj_01 obj_02)
   goals met: 0 of 3
4. (op_3 obj_01 obj_05 obj_02 obj_03)
   deleted: (pred_4 obj_01 obj_05 obj_03)
   added: (pred_3 obj_05 obj_02) (pred_2 obj_01 obj_03)
   goals met: 1 of 3
5. (op_2 obj_01 obj_06 obj_02 obj_03)
   deleted: (pred_3 obj_06 obj_02) (pred_2 obj_01 obj_03)
   added: (pred_4 obj_01 obj_06 obj_03)
   goals met: 1 of 3
6. (op_1 obj_01 obj_02 obj_04)
   deleted: (pred_1 obj_01 obj_02)
   added: (pred_1 obj_01 obj_04)
   goals met: 1 of 3
7. (op_3 obj_01 obj_06 obj_04 obj_03)
   deleted: (pred_4 obj_01 obj_06 obj_03)
   added: (pred_3 obj_06 obj_04) (pred_2 obj_01 obj_03)
   goals met: 2 of 3
8. (op_2 obj_01 obj_09 obj_04 obj_03)
   deleted: (pred_3 obj_09 obj_04) (pred_2 obj_01 obj_03)
   added: (pred_4 obj_01 obj_09 obj_03)
   goals met: 2 of 3
9. (op_1 obj_01 obj_04 obj_02)
   deleted: (pred_1 obj_01 obj_04)
   added: (pred_1 obj_01 obj_02)
   goals met: 2 of 3
10. (op_3 obj_01 obj_09 obj_02 obj_03)
   deleted: (pred_4 obj_01 obj_09 obj_03)
   added: (pred_3 obj_09 obj_02) (pred_2 obj_01 obj_03)
   goals met: 3 of 3
